--Долголюк Даниил
--Группа: 2
--Вариант 6

--Л.р. №2. Выборка данных. Один из запросов надо написать двумя способами и объяснить, 
---какой из вариантов будет работать быстрее и почему.

---Создать упорядоченные по факультетам списки:
---факультет – преподаватель – проект;
SELECT faculty, t.name AS tutor_name, p.name AS project_name
FROM v6_tutors AS t
JOIN v6_proj AS p ON t.id_tutor = p.id_tutor
ORDER BY faculty;
---рабочих проектов, в которых участвует более 3-х человек;
SELECT 
    p.name AS project_name, 
    count(pa.id) AS "Количество человек",
    t.faculty
FROM v6_proj AS p
JOIN v6_partic AS pa ON p.id = pa.id
JOIN v6_tutors AS t on t.id_tutor = p.id_tutor
WHERE p.status = 'рабочий'
GROUP BY t.faculty, p.name
HAVING count(pa.id) > 3;
---проектов, в которых нет активных участников.

---Убедиться с помощью запроса, что у каждого преподавателя не 
---более 10-ти активных проектов (выдать список нарушений). 
---Проверить, что один и тот же студент не участвует более чем в двух проектах одновременно 
---(выдать список пар проектов, в которых он участвует одновременно).
